---
kind: property
id: P:Autodesk.Revit.DB.TableMergedCell.Top
source: html/edc07be2-5e84-5b57-c268-7ada5cd6cb4d.htm
---
# Autodesk.Revit.DB.TableMergedCell.Top Property

Specifies the row index of the top-left corner of a table grid.

## Syntax (C#)
```csharp
public int Top { get; set; }
```